import React from "react";
import { useTranslation } from "react-i18next";

const PrivacyPolicy = () => {
  const { t } = useTranslation();
  return (
    <div className="space-y-6 text-gray-500 text-lg  mb-8">
      <p className="text-red-600 font-semibold animated fadeInUp text-2xl">
        條款及細則︰
      </p>
      <p className="animated fadeInUp">
        1.
        「煤氣160週年智慧燃展未來NFT暨大抽獎」(「活動」)由香港中華煤氣有限公司
        (「本公司」)舉辦。
        <br />
        2.
        動於2022年8月23日下午2時正至2022年9月13日晚上11時59分(香港時間)舉行。
        <br />
        3.
        就本活動而言，在本條款及細則中提及的所有日期及時間，以本公司系統時間為準。
        <br />
        4. 參加者須年滿18歲或以上及持有有效之香港居民身份證
        <br />
        5.
        請於參加本活動前仔細閱讀本條款及細則，一經參與本活動，閣下即被視為已接受本條款及細則並受其約束。如閣下不接受本條款及細則，則請勿參與本活動。本公司保留取消違反本條款及細則的參加者之抽獎及/或得獎資格的權利。
        <br />
        6.
        當參與本活動時，參加者會被要求向本公司提供個人資料。本公司亦可在本活動進行期間收集及使用其他個人資料，同時，參加者如參加本活動，參加者將視為同意本公司將其個人資料(包括但不限於參加者的姓名、電子郵件、電話號碼、地址、煤氣賬戶號碼等)轉移給第三方服務供應商作抽獎、獎品兌換及核實身份之用，參加者亦將被視為已授權本公司使用其個人資料作本活動的營運、抽獎、通訊、獎品兌換和資料核實之用。
        <br />
        7.
        每位參加者可免費獲得一個抽獎名額及NFT乙張(如適用)。於活動期間，凡經煤氣公司(適用於煤氣客戶中心、戶外展銷攤位、網上及電話訂購，不包括經銷商及代理商)購買爐具產品並填寫銷售單號碼及購買日期，經工作人員核實後可獲得多一個抽獎名額。每位合資格之參加者只可於活動期間參加抽獎一次及兩個抽獎名額。如同一銷售單號碼用作重複登記或於活動期間取消安裝爐具，其參加資格將被取消。
        <br />
        8.
        參加者須提供本公司所要求的個人資料包括煤氣賬戶號碼(只適用於購買爐具之參加者)，以作核實身份、換領禮品和程序所需之用。
        <br />
        9.
        參加者須確保所提交之姓名(與身份證相同)、電子郵件、電話號碼、銷售單號碼及購買日期正確，錯誤或不完整的資料將不獲處理，如有任何爭議，本公司保留最終決定權及解釋權。不論是由互聯網用戶，或是任何由技術或人為失誤而產生或導致的相關設備或程序錯誤，引致不正確或不準確的報名資料，本公司概不負責。
        <br />
        10.
        如發現或合理懷疑有損害參與過程、干預活動或網站運作，或有違反活動規則的行為及詐騙個案，本公司保留最終決定權及取消任何參加者的參與資格。如有任何參與資格被取消之事宜，有關參加者將不另獲事先通知。如發現任何詐騙個案，將可能導致參加者的報名及/或得獎資格被即時取消。
        <br />
        11. 是次獎品以抽籤形式進行，得獎者將以電郵形式通知領獎安排及事宜。
        <br />
        12.
        本活動並不接受授權代領，得獎者必須於指定日期或之前親自領取獎品，否則，得獎者將被視作放棄領獎權利，獎品亦將被沒收。得獎者不得要求補發。
        <br />
        13.
        每名得獎者於領獎時必須按指示向本公司證明其已符合參加本活動之資格，包括提供合資格參加活動之煤氣賬戶號碼、出示其有效之十八歲或以上人士之香港身份證正本及得獎換領信。
        <br />
        14. 若得獎者未能提供任何上述第
        14項所述證明文件作核實身份之用或任何上述證明與用作參加本活動的煤氣賬戶號碼所登記之資料不符或得獎者並未持有有效之十八歲或以上人士的香港居民身份證，本公司有權取消得獎者的得獎資格及沒收獎品，而不作另行通知。而本公司將不會安排再次抽獎、作出任何賠償、聲明及/或承擔任何義務、責任及/或後果。
        <br />
        15.
        所有獎品均不得轉讓、退換、兌換現金、積分及其他物品。得獎者須自行負責有關獎品之任何交通、搬運、保險等其他額外費用。
        <br />
        16.
        獎品的價格只供参考。本公司毋須就獎品的價值、任何實際市價與參考價格之間的差額、或其他原因作出任何聲明、賠償及/或承擔任何義務、責任及/或後果。如有任何爭議，本公司保留最終決定權。
        <br />
        17.
        本公司並不保證任何本活動獎品的供應，不論該產品/服務是由本公司或任何其他商戶提供。在產品/服務由第三方商戶而非本公司提供的情況下，本公司並不保證該產品/服務的質素或第三方商戶有否提供產品/服務或其表現，包括但不限於任何虛假商品說明、誤述、錯誤陳述、遺漏、未經授權的代表、不公平的貿易行為或其員工、管理人員或代理人的行為。閣下須直接與第三方商戶解決任何有關該商戶提供的產品/服務的任何投訴或糾紛。
        <br />
        18.
        一旦領取獎品後，若有損毀、遺失或被竊，本公司將不會補發、替換、維修、保養或作出任何賠償、聲明及/或承擔任何責任及/或後果。
        <br />
        19. 抽獎結果將於2022年9月21日，於Towngas Appliance
        Facebook專頁、英文虎報及星島日報內公佈。
        <br />
        20. 本公司之員工不得參加是次活動，以示公允。
        <br />
        21. 若有任何爭議，本公司保留最終決定權。
        <br />
        22. 推廣生意的競賽牌照號碼：55978, 55979
      </p>

      <p className="text-red-600 font-semibold animated fadeInUp text-2xl">
        收集個人資料聲明
      </p>
      <p className="animated fadeInUp">
        1.
        本活動由香港中華煤氣有限公司舉辦，與其委託的服務供應商(如有)負責統籌及執行
        <br />
        2. 於本活動期間所收集的參加者資料(包括但不限於第
        10項所述中收集到的資料)僅用於與本活動有關的所有目的。
        <br />
        3.
        於本活動中收集的資料(包括個人資料)可在未經相關參加者事先同意的情況下，披露及轉交給本公司就進行或監察有關本活動而聘任的資料處理者或委任的其他代理商，惟此等披露及轉交僅供此用途。有關資料將妥善保存及進行加密，並於本活動結束後
        90 日內銷毀。
        <br />
        4. 若閣下並未能向我們提供所要求的資料，則閣下無法參加本活動。
        <br />
        5. 有關本公司之私隱政策聲明，請瀏覽{" "}
        <a
          className="text-primary pl-1"
          href="https://www.towngas.com/en/Info/Privacy."
        >
          https://www.towngas.com/en/Info/Privacy
        </a>
      </p>
      <p className="text-red-600 font-semibold animated fadeInUp text-2xl">
        一般事項
      </p>
      <p className="animated fadeInUp">
        1.
        本公司擁有全權及決定酌情權根據此條款及細則釐定參加者是否符合資格參加本活動及/或領取獎品。
        <br />
        2.
        如因任何無法控制的原因，如技術故障或其他軟體的不相容性問題，致使合資格參加者未能參加本活動或引致任何遞交的資料有所遲延、遺失、錯誤的情況，本公司一概不負責。
        <br />
        3.
        所有資料均以本公司之紀錄為準，任何錯誤、不完整、虛假或重覆輸入將被視作無效，參加資格將被作廢而不作另行通知。
        <br />
        4.
        如發現參加者以空號、假賬戶、冒用或盜用任何第三者之資料或任何方式入侵及/或以修改/編寫/利用電腦程式或不誠實的方式參加本活動，本公司有權在任何時間取消參加者的參加本活動及/或得獎資格及收回已領取的獎品，而毋須通知及給予解釋，並對該參加者保留法律追訴權，參加者須承擔一切相關責任、賠償及後果。
        <br />
        5.
        本活動如有任何因電腦、網路、電話、技術或其他不可歸責於本公司之事由，而使參加者、得獎者或本公司所寄出或登錄之資料有遺失、錯誤、無法辨識或毀損，導致資料無效之情況，本公司不負任何法律責任，參加者或得獎者均不得異議。
        <br />
        6.
        閣下在本活動中如有任何舞弊及/或欺詐成分(由本公司全權決定)，本公司有權取消閣下參加本活動的資格。本公司保留權利取消閣下參加本活動及/或得獎資格及收回閣下因舞弊及/或欺詐而不恰當地獲得的任何獎品而不作另行通知及/或採取法律行動追討任何本公司蒙受的損失及損害。
        <br />
        7.
        若本活動因電腦病毒感染、蠕蟲或木馬程式、伺服器入侵、篡改、未經授權的干預、欺詐、技術故障、或任何其他本公司控制範圍以外的原因，而破壞或影響系統運作、安全性、公平性、誠信及本活動的正常運作，本公司有權延期、中止或取消本活動的有關部分，另本公司有權取消干預抽獎過程之參加者的資格，而無須發出通知。
        <br />
        8. 本公司對所有因領取、使用或享用各獎品之後果概不負責。
        <br />
        9. 所有圖片只供參考，奬品以實物為準。
        <br />
        10. 若宣傳資料所載資料與本條款及細則有任何歧義，一概以本條款及細則為準。
        <br />
        11.
        本活動於香港舉行。本條款及細則須受香港法例規管及按其詮釋，每名參加者接受香港法院的專屬司法管轄權管轄。
        <br />
        12. 以上條款及細則以本公司解讀為準。如有任何爭議，本公司保留最終決定權。
        <br />
        13.
        得獎者有責任遵照法例而支付（得獎者自己的開支）因獎品而牽涉的一切稅項、稅務、徵費或有關稅項。本公司恕不負責。
        <br />
        14.
        如因參加者或得獎者因違規或非法行為導致本公司或第三方損失，有關參加者或得獎者須負上一切責任。
        <br />
        15.
        任何人士若非本條款及細則的一方，不可根據《合約（第三者權利）條例》（香港法例第
        623 章）強制執行本條款及細則的任何條文。
        <br />
        16.
        本條款及細則受香港法律管轄並須根據其詮釋。閣下接受香港法院的專有司法管轄權。
        <br />
        17. 此等條款及細則的中英文版本如有任何爭議或不一致，概以英文版本為準。
        <br />
        18. 如對此活動有任何疑問，請致電
        6221 2956 查詢。
      </p>
    </div>
  );
};

export default PrivacyPolicy;
